National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>fyj9bHLTDUAKeZ26J2a6irQJPBsln9C2i/JVyEqUwOeI4E7wtsVS4NvHc1WnrBECAc2Pt9+OlWCx&#13;
np0V+/iINz2797YRWNd+B5V9R1rQm7SMlQE9aufngzJdOjBkHRgLJh4qXA/llin/DPUMgZVnrjJr&#13;
/Zga2MQFJ8DINOc05CUNwJZbX4mJndPHvJ+gZCrog8xcaRYj49QrgrHS7nWaxj7IpXCX1q1FXrjc&#13;
h1sa+eM71igsuwOhpWLndE10qmKJijR/0QGa+v1JDTfADmQzfQENlqTr0zngTgJD9LAwrnPyrqfI&#13;
VcTQ2tJL2K7rDkiHZUirGx70fJIFDwhL+Zondg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>PKSukiELo8jeex3r/+AuhN03O1U8pjYdL8ENLKNgZh3mR4l/ATL7nieblnYqSxiPZBLNc/SjnWh1&#13;
beicoKyLOVSi154vlZlmKrq9eolZWLtWItzQe1aeiFA069OSw8nEBH8YKFpdOSE7CFaDFVKOvg3d&#13;
Q22kvDjQyXY9YuGgnpauSm61C7PAxf0Eqat+11dlrJ2tZm3TY9/cIGSlqz9qckaZbDnmOG2jLFdP&#13;
khD6Jk6FTbkYUK1reshH+x0W9B7r1e1yYLq04Awyb98ZdOak2jKUAiXDjelKtGtNFMb7T5Fdr4ad&#13;
JBJBQJkiJQWwUQO6Lh9ZPrJqFpSwoDpQO4sNbqfbYPz9FKbQdu98sM8UISKL3HtNVvzvG1t+Dfyj&#13;
H+MQWhTmOxQphDQTYbNztjkZE/YZdzjfQVFCJb6uskrxELLG4h2P/ltL7+YwI+P3Yb8FEg/1XJwv&#13;
O3RP8KVA7MQHdflRjOjonTrWTQpT6srLUR4FPUso2jKW9CQNArJXp3EDBiPjD8R859NXi5Ngkkfk&#13;
gbAQJ7bHXgljdaZ/ecmLDBewuhCX0ytxXWCH0UEbbo0ojUaHCWCrfvvM9oLBX4zPe1CWD3wgIJxs&#13;
KZQ7B48ke74qF0apMmo1nziPDmIA/pk7nqVWOFFbjroXHweNjsgtU+YyAiilqVytJwi7i5Kx3+du&#13;
B7Wa7qvSy7v+XPhAJ9SSWvytGvX5SIiCRAFKbGNvxfy+i70PNB7n+3OtQZ3PCdEiDEXSMcGxsssI&#13;
OFadgr2HfpH9eAXKki6wZyYlqK+3cDGPzDaxyDFJyrKnC0V0cSvd3cFKPUbL8GLeGOf68AWhMgWk&#13;
7LcJdru/aZOe3yogkju/18bw+Lq79qHgyBeiebQL540Pw5neuMEbvuWkyXlF4SJSr1IB4cU1rxM1&#13;
y4vD4gtdijxEJpo1+i2c6Y0e+HFgezRJJ7KXWSV2B1+QjtpScwtvkel73dXmGOGonyMNfnmXc+ho&#13;
vdHrTGDQ/8QoS8KeoGmV1KnD9agpRRCUOjnerQVZByh6I/NsiKQvkSuJFOlwulbLW62gWnKHEfkU&#13;
aSlGX/DhtAHj4mjmQeWcxhyfY+4kZU8yN89518FIbLN75RcCufD/DRu4hRC8l6h3NtK1VaX/cvzs&#13;
w8eWxfNNK6eOzGXmqlyBzq83QkxNDF9DQ9QYdxwL1Bm8LIAfnvMx9Vy5+5+19A0Tki9hZb4a5HyH&#13;
4Gclv8/EPHiRFhjLaMPHZxbPvq0upFvgYUQbKcMxtJ9hYPzQvQsJmofY5Mz4hEj2cPKVpSpdpmkq&#13;
DhUSeyTUEwRSrAWLafW2b35I5+Fg4rLR8utm8LxSNeMO5yAYq3x3g7ZjB8vtOpuXx9b5tTPq2L0p&#13;
TSWYWdanaY56vy2fyQUg1giu1u6h/zaliJuR8qqxRXF16ooDtfOPFn2lPJTAODO5Y5vdplwKGlof&#13;
c5e4eCFK0VsxfkAzL0ZOJRENPvCBLJqSJNUYYaM2Qfta5JnooE8GRXGBxLqrhZ6K0r7ffc6/mpZ9&#13;
SchTzSaK3aqsJT44DLbIr6ve+zOmeYRuMzghYO/0Gfzb9zo7P5ScPBdU+TNiD4JK1MG4cCl7zo7n&#13;
F8AsytgAUuSMwa8AankwOg0cAVACz4rz0MdvVwcTueM75m5YeVzu15S18MOYBaghb6B6Dxiy6DYw&#13;
UJHLaO/UFkZ0Tws2c2TybxFRS2aZxCj8Zrsr7vk/LGW5dqT4hCqFMIApVB/a2uEDds3Hp2nWI68i&#13;
GOioF+FgiSmtPWi4jPlSwbR0+tcYwgPm8l88fAXAgXYJSU6PRRc5zB7LURmyn4I81E4OBSg8KL7f&#13;
jd/d/cnF//ouxG/Arky/5wd06OEkDwC5ZVBtTqtFnJWY5BeGYpThg85GPTyjc+fswdHuofoWWXHn&#13;
yVKMdv84a+lSiZJOpIVZeK+by1gjPmzQVLq0ySLJHkTPpt93bJ6ir+PGGNlVF5mhrmSzjDSo8ep3&#13;
Jr3ScQzFPEq9p346icxCm7jhq/x6HApFIt0pPz9qvfgoS5fIUt3K3Dck7kASo3QIEQKKGg246tLR&#13;
PbI40dw3x7CSSBdrCA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>/KTmva8/G5US+EvLprsEbjaymR0=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
IOs4Uhcebgk2cig1GOsPosmUfZOTyu8ZlV737jMT4fLSvCGWdrGmkYF1GdJOPGrZ+Z34ZGbLHGzh&#13;
LLKPXi0KXmxkpreW1injlrycBHCCHWTjQeAsB7S2jVmuwMhFsDu8NJRdARWWpTboULC9tKuOwAIX&#13;
kJQJCCoyxzHUz/QaC1p8idaH/U6692v/KRxYu7IbEMQZMvfH/Yqdk8kJm1V1yQDpN7mzPX4NMgYI&#13;
arMO4mXwqHeDJgtHycCejiRrkTC2j6j3MQXriJONN9SL3emzBzSIRtS3UEv0OIcYdUPyUdqtsV38&#13;
lqE8tpyz0YN0FivS+ODWIufSJG31b+yGmN5oaA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>